---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringEndsWith
source: html/74238ab3-9d4d-e672-1e0b-6d6a6349578f.htm
---
# FilterStringEndsWith Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.